---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedWood.WoodSecondaryPerlinScaleZ
source: html/cf857554-81a0-84f7-ad23-65bda6de8e33.htm
---
# Autodesk.Revit.DB.Visual.AdvancedWood.WoodSecondaryPerlinScaleZ Property

The property labeled "Anisotropic pos-z scale for secondary highlight perlin" from the "AdvancedWood" schema.

## Syntax (C#)
```csharp
public static string WoodSecondaryPerlinScaleZ { get; }
```

## Remarks
This property is of type "AssetPropertyDouble".